In [1]:
import pandas as pd
import numpy as np

# question 1

In [2]:
df=pd.read_csv(r'C:\Users\Admin\Downloads\titanic_dataset.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.shape

(891, 12)

# question 2

In [6]:
##droping irrelevant columns
df=df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [7]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [8]:
##finding missing values
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [9]:
##filling missing values
df['Age'].fillna(df['Age'].median(),inplace=True)
df['Embarked'].fillna(df['Embarked'].mode(),inplace=True)

In [10]:
##converting categorical variables to numerical variables
df=pd.get_dummies(df,columns=['Sex','Embarked'],drop_first=True)

In [11]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,1,0,1
1,1,1,38.0,1,0,71.2833,0,0,0
2,1,3,26.0,0,0,7.9250,0,0,1
3,1,1,35.0,1,0,53.1000,0,0,1
4,0,3,35.0,0,0,8.0500,1,0,1

In [12]:
##feature scaling
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
df[['Age','Fare']]=scaler.fit_transform(df[['Age','Fare']])

In [13]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0,3,-0.565736,1,0,-0.502445,1,0,1
1,1,1,0.663861,1,0,0.786845,0,0,0
2,1,3,-0.258337,0,0,-0.488854,0,0,1
3,1,1,0.433312,1,0,0.420730,0,0,1
4,0,3,0.433312,0,0,-0.486337,1,0,1

# question3

In [14]:
##splitting the data into feature and target variable
x=df.drop('Survived',axis=1)
y=df['Survived']

In [15]:
##import libraries
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC

In [16]:
knn=KNeighborsClassifier()
svm=SVC()

# question 4

In [20]:
from sklearn.model_selection import cross_val_score,StratifiedKFold
#k-fold cross validation for KNN
kfold=StratifiedKFold(n_splits=5,shuffle=True,random_state=42)
average_accuracy_knn=k_fold_scores_knn.mean()
print('Average accuracy(KNN):',average_accuracy_knn)

Average accuracy(KNN): 0.8013607990012483

In [21]:
svm_scores=cross_val_score(svm,x,y,cv=kfold)
svm_avg_accuracy=svm_scores=svm_scores.mean()
print('SVM Average Accuracy:',svm_avg_accuracy)

SVM Average Accuracy: 0.8260121775155357